Show / Hide Table of Contents
Class CssComponentLoading
Cross-section coponent loading
Inheritance
System.Object
CssComponentLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class CssComponentLoading
Constructors
Improve this Doc   View Source
CssComponentLoading()
Constructor
Declaration
public CssComponentLoading()
Properties
Improve this Doc   View Source
Id
Id of cross-section component
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Loading
Loading
Declaration
public List<CssComponentTimeLoading> Loading { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CssComponentTimeLoading>
 Improve this Doc
 View Source